{"products":[
    {"name": "Pacifica", 
        "description": "Kilka miesięcy przed zakończeniem produkcji piątej generacji Voyagera, która w ostatnich oferowana była tylko w Ameryce Północnej pod nazwą Town & Country, producent przedstawił w styczniu 2016 roku zupełnie nowy i zbudowany od podstaw model. Następca otrzymał nową nazwę Pacifica, którą w przeszłości nosił już wyższej klasy crossover w latach 2003-2007. Samochód stał się wyraźnie większy, a także zyskał bardziej luksusowy charakter[18] i po raz pierwszy - także hybrydowy napęd.", 
        "image_src": "/png/chrysler-pacifica.png",  
        "price": 70000, 
        "category_id": 3, 
        "year": 2018, 
        "is_available": 1, 
        "retailer_id": 1, 
        "color": "Srebny", 
        "body_type": "Van", 
        "engine": "Hybryda", 
        "gearbox": "Automatyczna"
    }
    ,
    {"name": "Challenger", 
        "description": "Samochód osobowy typu pony car klasy średniej, a następnie klasy wyższej produkowany pod amerykańską marką Dodge w latach 1974 – 1983 oraz ponownie od 2008 roku jako trzecia generacja.", 
        "image_src": "/png/dodge-challenger.png",  
        "price": 60000, 
        "category_id": 4, 
        "year": 2012, 
        "is_available": 1, 
        "retailer_id": 1, 
        "color": "Pomarańczowy", 
        "body_type": "Coupe", 
        "engine": "Benzynowy", 
        "gearbox": "Automatyczna"
    }
    ,
    {"name": "Viper", 
        "description": "Dodge Viper był też samochodem użytym w serialu telewizyjnym z lat 90. pod tytułem „Viper”, w którym Joe Astor kierował czerwonym Viperem Convertible z funkcją transformacji w srebrny supersamochód, różniący się wizualnie od standardowej wersji. Oprócz tego Viper po przemianie posiadał też masę gadżetów pomocnych w walce z przestępcami.", 
        "image_src": "/png/dodge-viper.png",  
        "price": 200000, 
        "category_id": 4, 
        "year": 1996, 
        "is_available": 1, 
        "retailer_id": 1, 
        "color": "Czerwony", 
        "body_type": "Kabriolet", 
        "engine": "Benzynowy", 
        "gearbox": "Manualna"
    }
    ,
    {"name": "Edge", 
        "description": "Samochód osobowy typu SUV klasy średniej produkowany pod amerykańską marką Ford od 2006 roku. Od 2014 roku produkowana jest druga generacja modelu.", 
        "image_src": "/png/ford-edge.png",  
        "price": 82000, 
        "category_id": 5, 
        "year": 2018, 
        "is_available": 1, 
        "retailer_id": 1, 
        "color": "Żółty", 
        "body_type": "Suv", 
        "engine": "Diesel", 
        "gearbox": "Automatyczna"
    }
    ,
    {"name": "Fiesta", 
        "description": "Ford Fiesta VII została zaprezentowana po raz pierwszy jesienią 2016 roku. Światowa premiera odbyła się 29 listopada 2016 w siedzibie europejskiego oddziału Forda w Kolonii. Samochód z racji ogromnego sukcesu rynkowego poprzednika i wyglądu często uznawanego za ponadczasowy, który de facto po 8 latach stażu rynkowego nadal nie odbiegał od języka stylistycznego Forda, pod względem stylizacji nadwozia przeszedł ewolucję, zachowując znaczne podobieństwo do szóstego wcielenia. ", 
        "image_src": "/png/ford-fiesta.png",  
        "price": 59000, 
        "category_id": 5, 
        "year": 2018, 
        "is_available": 1, 
        "retailer_id": 1, 
        "color": "Niebieski", 
        "body_type": "Hatchback", 
        "engine": "Benzynowy", 
        "gearbox": "Manualna"
    }
    ,
    {"name": "F150 Raptor", 
        "description": "Ford F-Series XII został zaprezentowany po raz pierwszy w 2008 roku. Pojazd został zadebiutowało podczas targów motoryzacyjnych w Detroit w styczniu 2008 roku. Auto dostępne było w trzech konfiguracjach rozmiarów kabiny pasażerskiej, czterech długościach skrzyni ładunkowej i siedmiu rodzajach wersji wykończenia, co daje łącznie 35 rozmaitych konfiguracji[5].", 
        "image_src": "/png/ford-raptor.png",  
        "price": 112000, 
        "category_id": 5, 
        "year": 2016, 
        "is_available": 1, 
        "retailer_id": 1, 
        "color": "Niebieski", 
        "body_type": "Pickup", 
        "engine": "Benzynowy", 
        "gearbox": "Automatyczna"
    }
    ,
    {"name": "Mustang", 
        "description": "Mustang czwartej generacji zadebiutował oficjalnie 5 grudnia 2013 roku w Barcelonie. Samochód po raz pierwszy w historii nie korzysta z rozwiązań technicznych opracowanych z myślą o innych modelach. Płyta podłogowa i silniki od początku projektowane były specjalnie z myślą o Mustangu. W przeciwieństwie do poprzedników auto trafi też do oficjalnej sieci dealerskiej Forda na Starym Kontynencie. VI generacja Forda Mustanga oferowana jest również na rynku polskim.", 
        "image_src": "/png/ford-mustang.png",  
        "price": 120000, 
        "category_id": 5, 
        "year": 2018, 
        "is_available": 1, 
        "retailer_id": 1, 
        "color": "Czarny", 
        "body_type": "Coupe", 
        "engine": "Benzynowy", 
        "gearbox": "Manualna"
    }
    ,
    {"name": "Acadia", 
        "description": "Na początku 2016 roku GMC zaprezentowało nową, drugą generację Acadii, która razem z bliźniaczymi przedstawionymi równolegle nowymi wcieleniami Buicka Enclave i Chevroleta Traverse powstała na nowej platformie General Motors o nazwie C1XX[8]. Samochód przeszedł obszerny zakres zmian w stosunku do poprzednika, stając się nieznacznie mniejszy i znacznie lżejszy.", 
        "image_src": "/png/gmc-acadia.png",  
        "price": 79000, 
        "category_id": 6, 
        "year": 2018, 
        "is_available": 1, 
        "retailer_id": 1, 
        "color": "Biały", 
        "body_type": "Suv", 
        "engine": "Benzynowy", 
        "gearbox": "Automatyczna"
    }
    ,
    {"name": "Savana", 
        "description": "GMC Savana to najdłużej produkowany nieprzerwanie model marki, wytwarzany od 1995 roku po dziś dzień. Przez dotychczasowe 25 lat produkcji, Savana przeszła trzy duże modernizacje, w ramach których samochód zmieniał wygląd reflektorów i zderzaków, a także dokonywano modernizacji jednostek napędowych.", 
        "image_src": "/png/gmc-savana.png",  
        "price": 34000, 
        "category_id": 6, 
        "year": 2004, 
        "is_available": 1, 
        "retailer_id": 1, 
        "color": "Biały", 
        "body_type": "Dostawczy", 
        "engine": "Benzynowy", 
        "gearbox": "Automatyczna"
    }
    ,
    {"name": "Cherokee", 
        "description": "Zupełnie nowy model o kodzie fabrycznym KL został opracowany wspólnie przez Chryslera i FIATA na płycie podłogowej Alfy Romeo zwanej Compact U.S. Wide użytej wcześniej do stworzenia bliźniaczej konstrukcji Dodge'a Darta oraz Fiata Viaggio.", 
        "image_src": "/png/jeep-cherokee.png",  
        "price": 84000, 
        "category_id": 7, 
        "year": 2017, 
        "is_available": 1, 
        "retailer_id": 1, 
        "color": "Szary", 
        "body_type": "Suv", 
        "engine": "Beznynowy", 
        "gearbox": "Automatyczna"
    }
    ,
    {"name": "Wrangler", 
        "description": "Czwarte, zupełnie nowe, zbudowane od podstaw wcielenie Wranglera oznaczone kodem fabrycznym JL zostało zaprezentowane jesienią 2017 roku[7]. Samochód zachował pod kątem stylistycznym ewolucyjny kierunek zmian, utrzymując zarówno podobne proporcje nadwozia, jak i wygląd przedniej i tylnej części nadwozia. Zachowano też charakterystyczne elementy jak np. zawiasy drzwi widoczne gołym okiem, okrągłe reflektory, uwydatnione nadkola i wyraźnie zanzaczona maska", 
        "image_src": "/png/jeep-wrangler.png",  
        "price": 54000, 
        "category_id": 7, 
        "year": 2014, 
        "is_available": 1, 
        "retailer_id": 1, 
        "color": "Czerwony", 
        "body_type": "Suv", 
        "engine": "Beznynowy", 
        "gearbox": "Automatyczna"
    }
    ,
    {"name": "Solstice", 
        "description": "Samochód sportowy produkowany przez należącą do koncernu General Motors firmę Pontiac. Zaprezentowany w 2004 na North American International Auto Show, wszedł do masowej produkcji w połowie 2005 roku jako rocznik 2006. Produkcja odbywała się w Wilmington (Delaware). Stylistyka nadwozia nawiązywała do prototypu z roku 2002 o tej samej nazwie[1]. Produkcja miała ruszyć latem roku 2005 jednak opóźnienia w fabryce przesunęły jej początek o cztery miesiące", 
        "image_src": "/png/pontiac-solstice.png",  
        "price": 36000, 
        "category_id": 8, 
        "year": 2004, 
        "is_available": 1, 
        "retailer_id": 1, 
        "color": "Srebny", 
        "body_type": "Kabriolet", 
        "engine": "Beznynowy", 
        "gearbox": "Manualna"
    }
    ,
    {"name": "Model S",
        "description": "Elektryczny samochód osobowy klasy średniej-wyższej produkowany przez amerykańską markę Tesla Motors od 2012 roku. ", 
        "image_src": "/png/tesla-model-s.png",  
        "price": 92000, 
        "category_id": 9, 
        "year": 2018, 
        "is_available": 1, 
        "retailer_id": 1, 
        "color": "Biały", 
        "body_type": "Sedan", 
        "engine": "Elektryczny", 
        "gearbox": "Automatyczna"
    },
    {"name": "Model 3", 
        "description": "Model 3 jest samochodem w pełni elektrycznym. Oficjalna prezentacja miała miejsce 31 marca 2016 roku, a oficjalne wydawanie aut nastąpiło 28 lipca 2017 roku", 
        "image_src": "/png/tesla-model-3.png",  
        "price": 200000, 
        "category_id": 9, 
        "year": 2020, 
        "is_available": 1, 
        "retailer_id": 1,
        "color": "Czerwony", 
        "body_type": "Sedan", 
        "engine": "Elektryczny", 
        "gearbox": "Automatyczna"
    }
    ,
    {"name": "Model X", 
        "description": "Elektryczny samochód osobowy typu crossover Coupe klasy F produkowany przez amerykańską markę Tesla Motors od 2015 roku. Pojazd został po raz pierwszy zaprezentowany podczas Tesla Design Studio w Los Angeles 9 lutego 2012 roku. Auto bazuje na Modelu S.", 
        "image_src": "/png/tesla-model-x.png",  
        "price": 111000, 
        "category_id": 9, 
        "year": 2019, 
        "is_available": 1, 
        "retailer_id": 1, 
        "color": "Czarny", 
        "body_type": "Suv", 
        "engine": "Elektryczny", 
        "gearbox": "Automatyczna"
    }
    
    ]
}